{
  "publishedAt": "2007-11-28T17:06:07-07:00",
  "body": "\u003cp\u003e\u003ca href='http://firegpg.tuxfamily.org/'\u003eFireGPG\u003c/a\u003e is a \u003ca\nhref='http://www.mozilla.com'\u003eFirefox\u003c/a\u003e extension that allows you to\nencrypt/decrypt/sign any textbox on any page.  More than that, it integrates\nwith Gmail so you can easily send and receive encrypted email!  I've been using\nit for this feature alone as soon as I found out about it's existence.  Now\nthere really is no reason to use an IMAP client in my opinion.\u003cbr\u003e\u003cbr\u003e\nSo\nwhat's so annoying about it?  Instead of relying on Firefox's own extension\nupdate notification system, FireGPG checks for updates every time you restart\nFirefox, and pops up an intrusive dialog asking if you want to upgrade.  That\n\u003ci\u003ecould\u003c/i\u003e be acceptable, except that FireGPG has updates ALL THE TIME.\nWorse than that, sometimes this dialog is displayed when you click on a link\nthat opens a new window.  Ok, you finally bite the bullet and choose to update,\ncausing you to have to restart Firefox.  You are now interrupted again with\nanother intrusive dialog outlining the changes in this update.  In the event\nthat Firefox crashes (as it often does) before you quit (does anyone ever quit\nFirefox?), the fact that you've been shown the changes dialog is not saved, and\nyou get to see it again when you restart.\n\u003cbr\u003e\u003cbr\u003eIf you're like me, you're\nfairly annoyed at this point, and you want to turn the auto updates off.  So,\nyou go to the options, and click the \u0026quot;Disable FireGPG's auto updates\u0026quot;.  Now you\nget a confirmation dialog asking if you're sure you want to disable the auto\nupdates, and that they recommend that you don't.  If you click \u0026quot;Ok\u0026quot;, you're\nprompted with \u003ci\u003eanother\u003c/i\u003e dialog informing you that FireGPG is still in beta\nand might have security issues (they don't mention this on their website in any\nobvious manner) and asking, again, if you're sure you want to disable auto\nupdates.  I almost didn't want to; who wants potential security\nissues?\u003cbr\u003e\u003cbr\u003e\nOk, I realize that security issues with GPG and encryption\nmight be a big problem.  I realize that with a new application that is\nsupposedly still in beta, not having automatic updates could result in a flow\nof duplicate bugs on an issue tracker.  However, I feel that the behavior of\nthis application is totally unacceptable, causing me to want to not use it at\nall. \u003cbr\u003e\u003cbr\u003e\nHere are my suggestions to the authors of FireGPG (and other\nextension developers):  Include the option to auto update, but have it disabled\nby default:  Firefox has an update system that seems to work very well.  In the\ncase of FireGPG where \u0026quot;potential security issues\u0026quot; can in fact be a huge\nproblem, use a non-intrusive method to notify the user that there is a security\nupdate.  An icon in the statusbar, or a system notification (like Gmail\nNotifier) would be MUCH less annoying.\u003c/p\u003e\n\u003cdiv class=\"restored-from-archive\"\u003e\n  \u003ch3\u003eRestored from VimTips archive\u003c/h3\u003e\n  \u003cp\u003e\n  This article was restored from the VimTips archive. There's probably\n  missing images and broken links (and even some flash references), but it\n  was still important to me to bring them back.\n  \u003c/p\u003e\n\u003c/div\u003e",
  "summary": "\u003cp\u003e\u003ca href='http://firegpg.tuxfamily.org/'\u003eFireGPG\u003c/a\u003e is a \u003ca\nhref='http://www.mozilla.com'\u003eFirefox\u003c/a\u003e extension that allows you to\nencrypt/decrypt/sign any textbox on any page.  More than that, it integrates\nwith Gmail so you can easily send and receive encrypted email!  I've been using\nit for this feature alone as soon as I found out about it's existence.  Now\nthere really is no reason to use an IMAP client in my opinion...\u003c/p\u003e\n",
  "title": "FireGPG - Very Useful, Very Annoying",
  "slug": "firegpg-very-useful-very-annoying",
  "tags": [
    "Miscellaneous"
  ],
  "isPublished": true
}