{
  "publishedAt": "2007-04-04T22:25:00-07:00",
  "body": "\u003cp\u003e\u003cb\u003eNote:\u003c/b\u003e  There is a \u003ca\nhref='http://www.exaile.org/wiki/index.php?title=Misc:HackingTracAccountManager'\u003eHOW-TO\u003c/a\u003e\nwritten up to show users how to deploy the information in this article.\u003cbr /\u003e\u003c/p\u003e\n\u003cp\u003eThe \u003ca href='http://www.exaile.org'\u003eExaile\u003c/a\u003e website and project uses trac to\nmanage the homepage wiki, and ticket system.  Trac is a great product, but a\nlot of users end up getting spam at some point.\u003c/p\u003e\n\u003cp\u003eWe solved this problem for a while by installing two spam filtering plugins,\nand installing \u003ca href='http://trac-hacks.org/wiki/AccountManagerPlugin'\u003eTrac's\nAccount Manager Plugin\u003c/a\u003e.  This requires a user to register for the site\nbefore they can post tickets and/or make comments on existing tickets (the\ndefault behavior for trac is to allow anyone at all post).\u003c/p\u003e\n\u003cp\u003eSpam bots and otherwise started getting around this anyway.\u003c/p\u003e\n\u003cp\u003eOne of the \u003ca href='http://www.jokosher.org/'\u003eJokosher\u003c/a\u003e developers is a user\nof Exaile, and he found out about our dilemma.  He told us how they managed to\nstop spam.\u003c/p\u003e\n\u003cp\u003eThey simply added a field to their registration form that says \u0026quot;What is the\nname of our audio editor?\u0026quot;.  The answer is so obvious.  Jokosher is the name.\nIt's in the domain name of the site.  It's in the logo at the top of the page.\u003c/p\u003e\n\u003cp\u003eThey claim this stopped spam all together, even better than an image captcha.\nThe idea is that even if a bot can't get around the registration, spammers will\nemploy human spammers for special exceptions.  An image captcha doesn't prevent\nspam from these people at all... they can see the answer right in front of\ntheir eyes.  However, it's probably not cost effective to make them look around\nfor something a legit user would already know.\u003c/p\u003e\n\u003cp\u003eI made some changes to Trac's Account Manager.  I added a field that says \u0026quot;What\nis Adam's IRC nickname\u0026quot;.  My nickname is in several obvious places on the\nwebsite, not to mention, there's a two click way to get into the IRC channel\nvia CGI::IRC.  In future releases of Exaile, a keyword will be available in the\nExaile about dialog which will be required to register.\u003c/p\u003e\n\u003cp\u003eI've written up a \u003ca\nhref='http://www.exaile.org/wiki/index.php?title=Misc:HackingTracAccountManager'\u003ehowto\u003c/a\u003e\non modifying the plugin.\u003c/p\u003e\n\u003cp\u003e\u003cb\u003eNote:\u003c/b\u003e I only just deployed this on our site.  I'll keep you updated on\nhow it works out.\u003c/p\u003e\n\u003cdiv class='vimtip'\u003e\n  \u003ch3\u003e\u003cb\u003evim tip:\u003c/b\u003e \u003ci\u003e:TOhtml\u003c/i\u003e\u003c/h3\u003e\n  \u003cp\u003e\n    Sometimes you want to post your code on a website somewhere.  Sometimes it's\n    nice to have this code display with the syntax highlighting you see in vim.\n    Just type @:TOhtml@, and a new window window will open up with the html for the\n    code you were looking at.  Note, that all the coloring will be the same\n    coloring you have for the current vim colorscheme your using (even the\n    background color), so be sure to pick a colorscheme that matches your site\n    before you do this.\n  \u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv class=\"restored-from-archive\"\u003e\n  \u003ch3\u003eRestored from VimTips archive\u003c/h3\u003e\n  \u003cp\u003e\n    This article was restored from the VimTips archive. There's probably\n    missing images and broken links (and even some flash references), but it\n    was still important to me to bring them back.\n  \u003c/p\u003e\n\u003c/div\u003e",
  "summary": "\u003cp\u003ePreventing spam on Trac...\u003c/p\u003e\n",
  "title": "Preventing spam on trac",
  "slug": "preventing-spam-on-trac",
  "tags": [
    "Random",
    "Linux"
  ],
  "isPublished": true,
  "openGraph": {
    "title": "Preventing spam on trac",
    "type": "article"
  }
}