{
  "publishedAt": "2007-11-04T01:51:48-07:00",
  "body": "\u003cp\u003eYup, this article is about the \u003ca href='http://apple.com/iphone'\u003eiPhone\u003c/a\u003e, so\nif you're sick of hearing about them, I'd advise you to move right\nalong.\u003c/p\u003e\n\u003cp\u003eI've had an iPhone since July 18th.  I'd say, overall, the iPhone and it's\nsoftware, out of the box (no hacks, etc), is pretty great.  I do have some\ncomplaints:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eThere is no MMS - this is my biggest problem with the phone.  It's also the\nmost mind boggling.  Why is this feature missing?\u003c/li\u003e\n\u003cli\u003eNo 3rd party application development.  This really isn't that big a deal to\nme, and I'll explain why later.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThat's it.  Those are my two complaints.  Everything else, I absolutely love.\nThere are a lot more complaints out there, but I think most of them are moot\npoints.\u003c/p\u003e\n\u003cp\u003eFirst, there's the \u003ci\u003e\u0026quot;there's no search!\u0026quot;\u003c/i\u003e complaint, which is outright\nstupid.  Why?  Yes, there is no menu item that says \u0026quot;search\u0026quot; anywhere...\nhowever, if you click on the SMS icon, click the \u0026quot;compose\u0026quot; button, and start\ntyping a name or number in the field, you will be provided with suggestions\nthat match from your address book.  This is the same as with sending emails.\nOk, there is nothing similar to this when searching for a specific track in the\niPod app, or in your contacts if you just want to make a phonecall, but I think\nwhat they have in place of a search actually reduces the amount of keystrokes\nyou'd use when searching.  Here's how it works.  In the middle of your screen,\nyou get a giant list of your contacts, each organized under headers for each\nletter of the alphabet.  You can scroll this list by moving your thumb or\nfinger; the faster you move your thumb, the faster and farther the list\nscrolls.  On the right of your screen, you get a list of the letters A-Z.  You\ncan click on a letter and it will scroll to that header, where you can fine\ntune your search by scrolling in the middle of the screen.\u003c/p\u003e\n\u003cp\u003eSecond, I've heard a lot of people say that the camera sucks.  The iPhone\ncamera is far superior to any phone camera I've witnessed myself, and I've seen\na lot.  Let me explain: my friend Jason has created a website, which we\nlovingly call \u003ca href='http://phonese.cx'\u003ePhonese\u003c/a\u003e.  The idea behind the\nwebsite is that you can send an email with a photo attachment (or an MMS) from\nyour phone to a specific email address, and that photo will show up in your\ngallery on the site.  My gallery can be found \u003ca\nhref='http://synic.phonese.cx'\u003ehere\u003c/a\u003e.  Ok, so, out of all 31 users on the\nsite, my iPhone's photos quality blows everyone else's out of the water.  It's\nsurprising how much better it looks.  Compare this photo from my iPhone:\n\u003ca href=\"http://synic.phonese.cx/comments.php?2793\"\u003ehttp://synic.phonese.cx/comments.php?2793\u003c/a\u003e to this photo that was taken when I\nstill had a Blackberry Pearl:  \u003ca href=\"http://synic.phonese.cx/comments.php?2263\"\u003ehttp://synic.phonese.cx/comments.php?2263\u003c/a\u003e.  In\nfact, browse the site, it's quite funny.  Compare anyones photos to my recent\nphotos.  Clearly, the iPhone is better. (\u003cb\u003enote:\u003c/b\u003e com4 just got an iPhone,\nso he might have some better quality pictures up soon enough).\u003c/p\u003e\n\u003cp\u003eFourth: Tactile response.  I guess I have to agree with this one: those who are\nused to dialing by touch would probably have a problem here.  Personally, I\nhave never dialed by touch.. probably because I'm too stupid to realize that I\ncould have done so.\u003c/p\u003e\n\u003cp\u003eFifth: Everyone says the keyboard sucks.  I'd have to disagree there.  The\nautocorrect feature is superb, and once you get used to it, you can fly with\nthis keyboard.  Just today I was texting someone, and my friend who was with me\nactually said, \u0026quot;whoa, look at you go!\u0026quot;.  \u003ci\u003eHowever\u003c/i\u003e, if you're typing in a\nfield that doesn't support autocorrect (like the address field in Safari), it\ncan be a problem if you don't aim exactly.\u003c/p\u003e\n\u003cp\u003e\u003cb\u003eOk, let's talk about 3rd party apps\u003c/b\u003e.  Yes, one of my complaints is that\n3rd party native application development is not allowed \u003ci\u003eyet\u003c/i\u003e.  I have\nhacked my iPhone, once on the 1.0.2 firmware and recently with the 1.1.1\nfirmware.  Not to unlock it or to have custom ringtones, but so I could have\napps like a terminal and an IRC client.  A lot of the apps actually make the\nphone more crash prone (I believe SummerBoard is one of the main culprits\nhere).  The ones I like to use, like Colloquy and MobileTerminal work pretty\nwell.  When they are installed, it does make me feel all warm and fuzzy to know\nthat they are there, however, when I updated to firmware 1.1.1 effectively\nwiping out all of my third party apps, I didn't really miss them, because in\nall honesty, I didn't use them that much.\u003c/p\u003e\n\u003cp\u003e\u003cb\u003eAppleCare\u003c/b\u003e:  you may see this as a plus or a minus.  Recently (within the\nlast week or two), my iPhone battery has been giving me a lot of grief.  Fully\ncharged, wireless and bluetooth turned off, and on standby, the battery cannot\nhold a charge through the night.  Something happened, and I don't know what.\nThe battery used to last MUCH longer - even with the wireless on and making\ncalls occasionally, I could usually get two or more days out of it.  One day it\njust stopped being able to do so.  I called AppleCare today, and told them my\nsymptoms.  They are sending me a \u0026quot;service\u0026quot; phone in a box with a postage paid\npackage inside that I can return my current phone with; it should arrive in 24\nto 48 hours.  This \u0026quot;service\u0026quot; phone is just an iPhone I can use until they\neither fix or replace my phone.  They'll send me back a new or my repaired\nphone, I send them back the service phone.  The service is great, but I'm none\ntoo excited that my battery just died on me after only a few months.\n\u003cb\u003e\u003cem\u003eshrug\u003c/em\u003e\u003c/b\u003e, it's an electronic device.  Things can go wrong, and that's\nwhat warranties are for.\u003c/p\u003e\n\u003cp\u003e\u003cb\u003eBottom Line\u003c/b\u003e:  the iPhone is an excellent cellphone and mp3 player.  I\nwould recommend it to anyone.\u003c/p\u003e\n\u003cdiv class=\"restored-from-archive\"\u003e\n  \u003ch3\u003eRestored from VimTips archive\u003c/h3\u003e\n  \u003cp\u003e\n  This article was restored from the VimTips archive. There's probably\n  missing images and broken links (and even some flash references), but it\n  was still important to me to bring them back.\n  \u003c/p\u003e\n\u003c/div\u003e",
  "summary": "\u003cp\u003eYup, this article is about the \u003ca href='http://apple.com/iphone'\u003eiPhone\u003c/a\u003e, so\nif you're sick of hearing about them, I'd advise you to move right along.\u003c/p\u003e\n",
  "title": "iPhone",
  "slug": "iphone",
  "tags": [
    "Random",
    "Gadgets"
  ],
  "isPublished": true
}