{
  "publishedAt": "2007-03-26T18:48:00-07:00",
  "body": "\u003cp\u003eI've been running Ubuntu for a while now (since Warty).  I usually end up\ndist-upgrading a few months early - which, thus far, has usually been a\nsomewhat painless ordeal.\u003cbr /\u003e\u003cbr /\u003e\u003c/p\u003e\n\u003cp\u003eBeing that Feisty is about to come out, I recently upgraded two of my machines.\nOn my home machine, everything went absolutely fine.  No problems whatsoever.\nMy work machine is a different story.  About halfway through the upgrade, I was\nno longer able to use my keyboard.  I  was at work... I couldn't just sit there\nand wait, so I powered the box off, and turned it back on.  Yeah, GDM wouldn't\nload, and I still couldn't use my keyboard.  I was forced to reinstall the\nwhole operating system.  I used the new Feisty CD (I'm not sure which one\nexactly, my coworker downloaded it), and now everything is running\ngreat.\u003cbr /\u003e\u003cbr /\u003e\u003c/p\u003e\n\u003cp\u003eDespite all of this, I still recommend upgrading if you're somewhat\nknowledgeable (because I'm crazy like that).  I'm actually thinking that the\nproblems I had were to be attributed to the new keyboard I bought.  It is a\nwireless (Logitech LX 710), and I'm not even sure I had it connected correctly\nbefore the upgrade.  So yeah, you should upgrade :)\u003c/p\u003e\n\u003cdiv class='vimtip'\u003e\n\u003ch3\u003e\n\u003cb\u003evim tip:\u003c/b\u003e \u003ci\u003eCombining Commands\u003c/i\u003e\n\u003c/h3\u003e\n\u003cp\u003e\nMost commands you can combine in vim.  \u003cb\u003ed\u003c/b\u003e stands for delete, and \u003cb\u003ew\u003c/b\u003e\nstands for move ahead one word.  If you type \u003cb\u003edw\u003c/b\u003e, it will delete the word\nthat you're on (or the rest of the word if the cursor is in the middle of it).\nIf you want to delete the entire word even if the cursor is in the middle, you\ncan type \u003cb\u003ediw\u003c/b\u003e.\n\u003cp\u003eIf you want to end up in insert mode after the word is deleted, you can type\n\u003cb\u003ecw\u003c/b\u003e or \u003cb\u003eciw\u003c/b\u003e (\u003cb\u003ec\u003c/b\u003e stands for change).\u003c/p\u003e\n\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv class=\"restored-from-archive\"\u003e\n  \u003ch3\u003eRestored from VimTips archive\u003c/h3\u003e\n  \u003cp\u003e\n  This article was restored from the VimTips archive. There's probably\n  missing images and broken links (and even some flash references), but it\n  was still important to me to bring them back.\n  \u003c/p\u003e\n\u003c/div\u003e",
  "summary": "\u003cp\u003eI've been running Ubuntu for a while now (since Warty).  I usually end up\ndist-upgrading a few months early - which, thus far, has usually been a\nsomewhat painless ordeal...\u003c/p\u003e\n",
  "title": "My experiences with upgrading to Feisty",
  "slug": "my-experiences-with-upgrading-to-feisty",
  "tags": [
    "Linux"
  ],
  "isPublished": true
}