{
  "publishedAt": "2007-05-17T23:17:40-07:00",
  "body": "\u003cp\u003eExaile 0.2.10 is well on it\u0026#8217;s way.  \u003c/p\u003e\n\u003cp\u003eAll plugins have been moved out of the regular Exaile repository, and into\ntheir own.  The script located \u003ca\nhref='http://exaile.org/plugins/plugins.py?version=trunk'\u003ehere\u003c/a\u003e reads\ninformation directly from \u003ca\nhref='http://exaile.org/trac/browser/plugins/trunk'\u003eExaile\u0026#8217;s trac source\nbrowser\u003c/a\u003e to keep up-to-date plugin list (trac watches our svn repository),\neven if we\u0026#8217;ve just committed changes.  \u003c/p\u003e\n\u003cp\u003eThis will come to play in the new plugin manager, which I\u0026#8217;ve started\nto work on.  When the user opens the plugin manager, they will see an available\nplugins tab.  When they click on that tab, an updated plugin list will be\ndownloaded from the \u003ca\nhref='http://exaile.org/plugins/plugins.py?version=trunk'\u003eplugin list\nscript\u003c/a\u003e running on Exaile.org,\u003c/p\u003e\n\u003cp\u003eCurrently, the user can install plugins from here.  Eventually, they will\nalso be able to remove and upgrade plugins from here.\u003c/p\u003e\n\u003cp\u003eAlso, the pluggable radio system is done, and the shoutcast plugin has been\nwritten.  Everything works as it used to, but new plugins will be able to be\nwritten to get radio stations from other stream directories.\u003c/p\u003e\n\u003cdiv class='vimtip'\u003e\n\u003ch3\u003e\u003cb\u003evim tip:\u003c/b\u003e \u003ci\u003eRemote File Editing\u003c/i\u003e\u003c/h3\u003e\n\u003cp\u003e\nYou can edit files on a remote server that\u0026#8217;s running an ssh daemon by\ntyping something like the following:\n\u003cp\u003e\u003ccode\u003e:e scp://synic@jbother.org//etc/apt/sources.list\u003c/code\u003e\u003c/p\u003e\n\u003cp\u003ehe \u003ccode\u003e:e\u003c/code\u003e, of course, means edit file.  The \u003ccode\u003escp://\u003c/code\u003e\nmeans use the scp protocol (you can experiment with different protocols here.\nhttp:// and ftp:// work, but obviously some of these protocols will be read\nonly).  The \u003ccode\u003e\u003ca href=\"mailto:synic@jbother.org\"\u003esynic@jbother.org\u003c/a\u003e\u003c/code\u003e is “username at host”.\nThe following slash is required (and is usually a \u003cb\u003e:\u003c/b\u003e on the command line,\nbut in vim, it’s a slash for a reasons I don’t know).  Everything\nafter that is the path of the file you want to edit on the remote server.\u003c/p\u003e\n\u003cp\u003eWhen you press enter, vim will prompt for the user’s password.  When\nyou save the file with \u003ccode\u003e:w\u003c/code\u003e, you will be prompted for the password\nagain.\u003c/p\u003e\n\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv class=\"restored-from-archive\"\u003e\n  \u003ch3\u003eRestored from VimTips archive\u003c/h3\u003e\n  \u003cp\u003e\n  This article was restored from the VimTips archive. There's probably\n  missing images and broken links (and even some flash references), but it\n  was still important to me to bring them back.\n  \u003c/p\u003e\n\u003c/div\u003e",
  "summary": "\u003cp\u003eExaile 0.2.10 is well on it’s way...\u003c/p\u003e\n",
  "title": "Exaile Updates",
  "slug": "exaile-updates",
  "tags": [
    "Exaile"
  ],
  "isPublished": true
}