{
  "publishedAt": "2008-09-06T18:54:12-07:00",
  "body": "\u003cp\u003eI recently purchased an EeePC 1000h, and I'm going to give a quick review here.\u003cbr\u003e\u003cbr\u003e\u003c/p\u003e\n\u003cp\u003eFirst things first, I purchased the 1000h rather than the 1000 because of the\n80GB HDD instead of the 40GB SSD.  In part because of the price, the 1000h was\nabout $100 cheaper than the 1000, even though it only comes with Windows XP (as\nopposed to Linux).  Also in part because I guess I'm old school or something.\nI still don't trust SSD.  Even though I'm sure I'd never actually have a\nproblem, the phrase \u003ci\u003elimited writes\u003c/i\u003e scares me.\u003cbr\u003e\u003cbr\u003e\u003c/p\u003e\n\u003cp\u003eEven though the machine came with XP, I never actually booted into it.  I have\nno idea how this machine works with Windows.  I used the guide located here: \u003ca\nhref='https://help.ubuntu.com/community/Installation/FromUSBStick'\u003e\n\u003ca href=\"https://help.ubuntu.com/community/Installation/FromUSBStick\"\u003ehttps://help.ubuntu.com/community/Installation/FromUSBStick\u003c/a\u003e\u003c/a\u003e\nto create a boot ISO of Ubuntu 8.04, and the guide here: \u003ca\nhref='http://www.array.org/ubuntu'\u003e\u003ca href=\"http://www.array.org/ubuntu\"\u003ehttp://www.array.org/ubuntu\u003c/a\u003e\u003c/a\u003e to get all\nof the EeePC specific hardware working.  The only problem I encountered here is\nthat, even after I installed the custom eee kernel from array.org, I couldn't\nget the wireless card to work.  I jumped in #eeepc on freenode IRC, and quickly\nfound out that the wireless card in the 1000h is disabled in the BIOS by\ndefault (what the hell?).  Enabling it quickly fixed the problem.  Everything\nelse just worked.\u003c/p\u003e\n\u003cp\u003e\u003cb\u003ePros:\u003c/b\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eThe battery lasts about 5 hours.  Longer than any other laptop I've ever\nhad\u003c/li\u003e\n\u003cli\u003eThe video card can handle compiz very well\u003c/li\u003e\n\u003cli\u003eWireless card appears to have a good range (as opposed to my compaq\npresario v1000 which would drop packets even if the AP was just in the next\nroom)\u003cli\u003e\n\u003cli\u003eI like the size, it's very portable, and comes with a cool travel case\u003c/li\u003e\n\u003cli\u003eEverything I'd come to expect from a laptop works, including Sleep,\nHibernate, and different power modes when on battery or AC\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cb\u003eCons:\u003c/b\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eThe right shift key is in a very awkward position.  If you're a touch\ntypist, you're going to hit the pageup key more times on accident than the\nintended shift key.  This is true for me, even after a two weeks of trying to\nget used to it\u003c/li\u003e\n\u003cli\u003eIt took me at least 20 minutes to remove the stupid \"Made for Windows XP\"\nand various other stickers from the unit.  Haha.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOverall, I really like the machine.  Small, portable, functional, and at $549\nfrom Amazon, it's hard to beat.\u003c/p\u003e\n",
  "summary": "\u003cp\u003eI recently purchased an EeePC 1000h, and I'm going to give a quick review\nhere...\u003c/p\u003e\n",
  "title": "Asus EeePC 1000h",
  "slug": "asus-eeepc-1000h",
  "tags": [
    "Gadgets"
  ],
  "isPublished": true
}