{
  "publishedAt": "2008-11-17T18:54:10-07:00",
  "body": "\u003cp\u003eIf you're following me on Twitter, you'll know that recently installed Windows\nVista so that I could stream Netflix to my Xbox 360.  That venture didn't quite\nwork out, apparently Microsoft is working with Netflix and the new Xbox update\ndue on November 19th will have built in Netflix support.  Updates to the\nNetflix interface have caused the vmcNetflix extender for Vista Media Player to\nstop working. So really, I never needed to install Vista in the first place.\u003cbr\n/\u003e\u003cbr /\u003e\nMeanwhile, with Windows installed on one of my machines, I finally\ngot to try out \u003ca href=\"http://www.google.com/chrome\"\u003eChrome\u003c/a\u003e.  I quite like\nit.  It got me searching for a way to at least run it in Wine on Linux, and I\nfound this: \u003ca\nhref='http://media.codeweavers.com/pub/crossover/chromium/cxchromium_0.9.0-1_i386.deb'\u003ecxchromium\u003c/a\u003e.\nA Crossover port of Chromium - it's basically a proof of concept for the\nCrossover folks.  Here's a few links to Ubuntu .deb files: the \u003ca\nhref='http://media.codeweavers.com/pub/crossover/chromium/cxchromium_0.9.0-1_i386.deb'\u003ei386\nversion\u003c/a\u003e or the \u003ca\nhref='http://media.codeweavers.com/pub/crossover/chromium/ia32-cxchromium_0.9.0-1_amd64.deb'\u003eamd64\nversion\u003c/a\u003e.  As expected, it has quite a few issues, and I'm not even sure\nI'll be using it.  I guess I'll wait for it to be released natively on Linux.\n\u003cbr\u003e\u003cbr\u003e\n.. and then I got to thinking: who says it'll be released natively\non Linux?  I admit, I'm not an avid follower of the Chrome project, but they\nhaven't released a truly native version of Picasa for Linux yet (the current\nversions is a Wine bundle), they never did release a Linux client for Google\ntalk.  While I really hope there will be a native version of Chrome, I'm not\ngoing to hold my breath.\u003c/p\u003e\n\u003cdiv class=\"restored-from-archive\"\u003e\n  \u003ch3\u003eRestored from VimTips archive\u003c/h3\u003e\n  \u003cp\u003e\n  This article was restored from the VimTips archive. There's probably\n  missing images and broken links (and even some flash references), but it\n  was still important to me to bring them back.\n  \u003c/p\u003e\n\u003c/div\u003e",
  "summary": "\u003cp\u003eIf you're following me on Twitter, you'll know that recently installed Windows\nVista so that I could stream Netflix to my Xbox 360.  That venture didn't quite\nwork out, apparently Microsoft is working with Netflix and the new Xbox update\ndue on November 19th will have built in Netflix support.  Updates to the\nNetflix interface have caused the vmcNetflix extender for Vista Media Player to\nstop working. So really, I never needed to install Vista in the first place.\u003c/p\u003e\n",
  "title": "Crossover Chromium",
  "slug": "crossover-chromium",
  "tags": [
    "Miscellaneous"
  ],
  "isPublished": true
}