{
  "publishedAt": "2008-07-14T16:52:40-07:00",
  "body": "\u003cp\u003eI downloaded the new iPhone software last Friday after my coworker informed me\nthat there was a \u0026quot;Pandora Radio\u0026quot; application available on the AppStore.\nInternet radio on your phone?  No brainer, had to have it.\u003cbr\u003e\u003cbr\u003e\u003c/p\u003e\n\u003cp\u003eAfter getting everything updated and installing the app, I was also delighted\nto see that it worked decently on EDGE.  However, once I got into my car and\ntried to listen to some \u0026quot;Shiloh Radio\u0026quot; on the way home from work, I was\ndisappointed once I realized that the usual interference that I get if I don't\nput the phone on \u0026quot;Airplane Mode\u0026quot; was there, only a lot worse because,\nobviously, internet radio requires constant streaming from the data\nnetwork.\u003cbr\u003e\u003cbr\u003e\u003c/p\u003e\n\u003cp\u003eOver the weekend, I waited in the Apple Store line, and purchased the new 3G\niPhone.  There are lots of reasons that I decided to do this, but the real one\nis \u0026quot;I like to waste my money on cool gadgets\u0026quot;; the other reasons are mostly\njust justification of this one.\u003cbr\u003e\u003cbr\u003e\u003c/p\u003e\n\u003cp\u003eYeah, it's got built in GPS.  The speakers are better.  The battery lasts\nlonger (at least, longer than my old iPhone, which probably has a pretty weak\nbattery at this point).  3G is pretty cool, though not \u003cem\u003ethat\u003c/em\u003e much faster than\nEDGE.  The real kicker:  I tried Pandora in my car on the way to work this\nmorning just for the hell of it.  Absolutely no interference.  I haven't\ndetermined if this is because of the new phone case design, or the 3G network\nitself.  In addition to this, I noticed there is a new Last.FM app in the\nAppStore!\u003cbr\u003e\u003cbr\u003e\u003c/p\u003e\n\u003cp\u003eThe iPhone has it's flaws (one of my major complaints is that there is \u003ci\u003estill\nno non-annoying way to send and receive MMS\u003c/i\u003e), but seriously, who cares if\nyou can get internet radio in your car \u003cb\u003efrom your phone\u003c/b\u003e.\u003cbr\u003e\u003cbr\u003e\u003c/p\u003e\n\u003cp\u003eI may update with a more comprehensive review of the new iPhone, that is, if I\nfind that the differences between it and it's predecessor are worth mentioning.\u003c/p\u003e\n\u003cdiv class=\"restored-from-archive\"\u003e\n  \u003ch3\u003eRestored from VimTips archive\u003c/h3\u003e\n  \u003cp\u003e\n  This article was restored from the VimTips archive. There's probably\n  missing images and broken links (and even some flash references), but it\n  was still important to me to bring them back.\n  \u003c/p\u003e\n\u003c/div\u003e",
  "summary": "\u003cp\u003eI downloaded the new iPhone software last Friday after my coworker informed me\nthat there was a \u0026quot;Pandora Radio\u0026quot; application available on the AppStore.\nInternet radio on your phone?  No brainer, had to have it...\u003c/p\u003e\n",
  "title": "iPhone 3G, no interference",
  "slug": "iphone-3g-no-interference",
  "tags": [
    "Miscellaneous",
    "Gadgets"
  ],
  "isPublished": true
}