{
  "publishedAt": "2009-06-04T23:31:04-07:00",
  "body": "\u003cp\u003eSo, work got me a \u003ca\nhref='http://www.sonystyle.com/webapp/wcs/stores/servlet/ProductDisplay?catalogId=10551\u0026storeId=10151\u0026langId=-1\u0026productId=8198552921665562069'\u003eSony\nPRS-700\u003c/a\u003e for being awesome, which is awesome, so here are my thoughts so\nfar.\u003c/p\u003e\n\u003cp\u003eeBook readers are pretty cool.  It brings back a lot of nostalgia - when I was\n20 the company I was working for bought me a Palm Pilot, and the only things I\nreally used it for was as a phone book and to read ebooks.  I took it with me\nwhen I traveled, read the entire \u0026quot;Ender's Series\u0026quot; on it, as well as\n\u0026quot;Dreamcatcher\u0026quot; by Stephen King before my cat tipped a glass of water over on\nit.  Stupid cat.  Anyway, it reminds me of those times.\u003c/p\u003e\n\u003cp\u003eYou might ask: why not just carry a book around?  Good question.  The\nadvantages over a regular book, as I see them, are the ability to read in the\ndark, and the ability to make a bookmark that won't fall out because of\ngravity.  That's about it.  They are a little easier to hold, and to change\npages as well, but these are minor.  For me, the fact that it has enough space\nto hold hundreds of books is nice, but it's not really an advantage.  I don't\nusually read more than one book at a time, so I'd be fine if it just held one\nor two... but not everyone uses them just to read novels.\u003c/p\u003e\n\u003cp\u003eThe PRS-700 has several advantages over my old Palm Pilot:\u003c/p\u003e\n\u003cp\u003eThe battery lasts forever.  I haven't yet been able to drain the battery\nentirely, but it has already lasted longer than my Palm did.  It's supposed to\nlast for 10,000 page turns.  That's a lot.\u003c/p\u003e\n\u003cp\u003eE-Paper.  The idea is a screen that is higher contrast than you'd get on a\nregular LCD screen, and something that you'll be able to read in a high light\nsituation (for example, in the sunlight).  For the most part, it does these\nthings, however, you can tell the technology is in it's early years because the\nrefresh rate is really low and the contrast could be a lot better.\u003c/p\u003e\n\u003cp\u003eThe PRS-700 comes with a light (which is something that the competition doesn't\nhave yet), a touchscreen (which is cool, but I don't think it's really\nnecessary), and a groovy carrying case.\u003c/p\u003e\n\u003cp\u003eThe biggest downside is this:  I have a paperback copy of \u0026quot;Snow Crash\u0026quot; (thanks\nCourtney!), and it's next on my list, so I decided to get on Sony's Ebook store\nand download it for the Reader.  The ebook version costs $10.50!!! More than\nthe paperback!  I'm thinking that this is a little outrageous, so I check out\nother places like fictionwise.  I find out that $10.50 is actually a discount\nfrom the cost of $15.00 that most places are charging.  Ah well, there are\nother ways to get ebooks.\u003c/p\u003e\n\u003cdiv class=\"restored-from-archive\"\u003e\n  \u003ch3\u003eRestored from VimTips archive\u003c/h3\u003e\n  \u003cp\u003e\n  This article was restored from the VimTips archive. There's probably\n  missing images and broken links (and even some flash references), but it\n  was still important to me to bring them back.\n  \u003c/p\u003e\n\u003c/div\u003e",
  "summary": "\u003cp\u003eSo, work got me a \u003ca\nhref='http://www.sonystyle.com/webapp/wcs/stores/servlet/ProductDisplay?catalogId=10551\u0026storeId=10151\u0026langId=-1\u0026productId=8198552921665562069'\u003eSony\nPRS-700\u003c/a\u003e for being awesome, which is awesome, so here are my thoughts so\nfar.\u003c/p\u003e\n",
  "title": "Sony Reader (PRS-700) Review",
  "slug": "sony-reader-prs-700-review",
  "tags": [
    "Random",
    "Gadgets"
  ],
  "isPublished": true,
  "openGraph": {
    "title": "Sony Reader (PRS-700) Review",
    "type": "article"
  }
}