{
  "publishedAt": "2009-04-24T00:59:41-07:00",
  "body": "\u003cp\u003eFollowing the tradition of retarded naming schemes, Jaunty Jackalope was\nreleased today.  I've successfully upgraded 4 machines (three from aptitude\nsafe-upgrades, and one from a fresh install).  Here are some notes I've\ngathered so far:\u003c/p\u003e\n\u003cp\u003e\u003cul\u003e\n\u003cli\u003eMy home machine would not load X, complaining about the nvidia drivers.  In\norder to fix this, I had to install nvidia-glx-180\u003c/li\u003e\n\u003cli\u003eMy home machine is using a prism54 card, which did not work after the\nupgrade.  After fiddling around with it for a while, I found that blacklisting\nthe p54pci module (which worked prior to the upgrade) and loading the prism54\nmodule instead worked just fine\u003c/li\u003e\n\u003cli\u003eMy EeePC 1000h (which was installed from scratch) worked perfectly once the\ninstallation completed.  This hasn't ever happened before with previous\nversions of Ubuntu.  I usually needed to manually install wireless and nic\ndrivers.\u003c/li\u003e\n\u003cli\u003eOne of the machines I upgraded failed near the end with a problem\nconcerning dbus and hal.  An \"apt-get install --reinstall hal\" fixed the\nproblem\u003c/li\u003e\n\u003cli\u003eThe application menu editor no longer works whatsoever.  Right click on\n\"Applications\", go to edit menus, and nothing happens.  This is the case on all\nof my machines.\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/p\u003e\n\u003cp\u003eAll in all, the upgrade process hasn't been that bad.  There are some cool\nnew graphics (the new usplash and gdm themes look much better).  There haven't\nbeen any \"holy crap, look at that\" features that I've seen yet, but it's only\nbeen less than a day.\u003c/p\u003e\n\u003cp\u003eOn another note, if you're in the software development business and you use\nUbuntu on your production servers, don't plan any of your own releases near any\nof Ubuntu releases.  Trying to install some needed packages on our servers\nproved difficult with everyone else hoarding the bandwidth trying to download\nthe new version.\u003c/p\u003e\n\u003ch3\u003eUpdate: Sat Apr 25, 9:39AM\u003c/h3\u003e\n\u003cp\u003eI've upgraded my last machine from Intrepid to Jaunty, my EeeBox.  Flawless\nvictory, upgrade went without a hitch.  I'd say that all in all, this has been\nthe easiest upgrade for me. \u003c/p\u003e\n\u003cdiv class=\"restored-from-archive\"\u003e\n  \u003ch3\u003eRestored from VimTips archive\u003c/h3\u003e\n  \u003cp\u003e\n  This article was restored from the VimTips archive. There's probably\n  missing images and broken links (and even some flash references), but it\n  was still important to me to bring them back.\n  \u003c/p\u003e\n\u003c/div\u003e",
  "summary": "\u003cp\u003eFollowing the tradition of retarded naming schemes, Jaunty Jackalope was released today...\u003c/p\u003e\n",
  "title": "Ubuntu 9.04  - Jaunty Jackalope",
  "slug": "ubuntu-904-jaunty-jackalope",
  "tags": [
    "Linux"
  ],
  "isPublished": true
}
