{
  "publishedAt": "2010-04-12T16:53:29-07:00",
  "body": "\u003cp\u003eIt's been a while since I posted anything; but not to worry.  I'm still alive.  I've been super busy in my free time, with a top-secret Android project.  It's getting closer to being done, so hopefully I'll be able to post more details about it soon.\u003c/p\u003e\n\u003cp\u003eMeanwhile, I found a new way to waste my time on the internet (we all need those, right?).  During my latest project, I had a question, and someone recommended I ask it on \u003ca href='http://stackoverflow.com'\u003e\u003ca href=\"http://stackoverflow.com\"\u003ehttp://stackoverflow.com\u003c/a\u003e\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eI had heard of stackoverflow, and I'm not sure why I had never used it prior to this (perhaps it was that it kind of looked like a forum, or a mailing list), but I'm pretty sure I'm addicted at this point.  It's better than a mailing list when it comes to asking questions.\u003c/p\u003e\n\u003cp\u003eThe idea is that you can post questions about programming (any language, any topic that has to do with the process of programming), and other members using the site will answer your questions.  The thing is, your question will be answered, correctly, usually, faster than any other method I've seen (forums, mailing lists).  The answer will be high quality and will usually include some code or links to places you can find more information.  It's all free, it's got an intuitive interface, and it's very fast.\u003c/p\u003e\n\u003cp\u003eWhat motivates your peers on stackoverflow to answer your questions quickly and for free?  An achievement (ala xbox 360) style reward system.  The more questions you answer correctly, the more karma you get.  You get certain \u003ca href=\"http://blog.stackoverflow.com/2008/07/stack-overflow-badge-feedbac/\"\u003e\u0026quot;badges\u0026quot;\u003c/a\u003e for different things you do on the site.   If you answer a question incorrectly, you lost karma.  That's basically it.\u003c/p\u003e\n\u003cp\u003eWhy does it work?  This karma doesn't produce money.  These badges aren't worth anything outside stackoverflow.  Bragging rights?  I don't know, but it's just the type of thing that attracts computer nerds.  Users are motivated by receiving these superficial rewards, hell... it motivates me to answer questions on there.  It's a civilized pissing match.  It's actually quite fun.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"http://www.stackoverflow.com\"\u003estackoverflow.com\u003c/a\u003e is for programming questions, but they also have \u003ca href=\"http://www.serverfault.com\"\u003eserverfault.com\u003c/a\u003e for questions relating to server administration, and \u003ca href=\"http://www.superuser.com\"\u003esuperuser.com\u003c/a\u003e for questions related to every day desktop computer use.\u003c/p\u003e\n",
  "summary": "",
  "title": "stackoverflow",
  "slug": "stackoverflow",
  "tags": [
    "Programming"
  ],
  "isPublished": true,
  "openGraph": {
    "title": "stackoverflow",
    "type": "article"
  }
}