{
  "publishedAt": "2012-02-14T19:29:40-07:00",
  "body": "\u003cp\u003e\u003ca href=\"http://synicworld.com/2009/12/22/supacount-published-android-market/\"\u003eA few years\nago\u003c/a\u003e\nI posted \u003ca href=\"http://bitbucket.org/synic/supacount\"\u003eSupaCount\u003c/a\u003e to the\nAndroid market. Shortly after that, I stopped posting updates for three\nyears.\u003c/p\u003e\n\u003cp\u003eThe reason for this? I lost my signing key. Even if I wanted to make\nupdates to it, I couldn't upload it to the same project on the Android\nMarket, at least, not without a lot of grief. So, I just avoided it...\nthough it wasn't a huge problem. Since I uploaded it, I haven't gotten\none error report in the market dashboard, so it must be working.\nHowever, during that time using it myself, I noticed a few features I've\nwanted here or there that would just make things easier.\u003c/p\u003e\n\u003cp\u003eSo, over the weekend, I rewrote the entire app in Scala. Why a rewrite?\nI dunno, just because I wanted an excuse to learn Scala and Scala for\nAndroid. I've named this one \u0026quot;DupaCount\u0026quot;. \u0026quot;SupaCount\u0026quot; will remain on the\nmarket, but with a blurb that it's been replaced. During the rewrite, I\nadded the few features that I wanted:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eIf you reboot the phone while a timer is running, it will still\nalert as expected. This one really is more of a bug, but people\nprobably didn't notice as most wouldn't make a timer that runs\nlonger than a few hours. I've run timers for up to 2 months before,\nand though they always kept counting down, they wouldn't always\nalert if I had rebooted during that time.\u003c/li\u003e\n\u003cli\u003eThere is an easy to see \u0026amp; access button at the bottom of the main\nscreen called \u0026quot;Add Timer\u0026quot;\u003c/li\u003e\n\u003cli\u003eThe \u0026quot;description\u0026quot; field in the Add Timer dialog has been made\noptional. If you leave it blank, it will default to a display of the\ntimer time. This will make it much easier to add a timer.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAnyway, the app can be found here:\n\u003ca href=\"https://market.android.com/details?id=com.synicworld.dupacount\"\u003ehttps://market.android.com/details?id=com.synicworld.dupacount\u003c/a\u003e, and the\nsourcecode can be found here: \u003ca href=\"http://bitbucket.org/synic/dupacount\"\u003ehttp://bitbucket.org/synic/dupacount\u003c/a\u003e\u003c/p\u003e\n\u003cdiv class=\"restored-from-archive\"\u003e\n  \u003ch3\u003eRestored from VimTips archive\u003c/h3\u003e\n  \u003cp\u003e\n  This article was restored from the VimTips archive. There's probably\n  missing images and broken links (and even some flash references), but it\n  was still important to me to bring them back.\n  \u003c/p\u003e\n\u003c/div\u003e",
  "summary": "\u003cp\u003e\u003ca href=\"http://synicworld.com/2009/12/22/supacount-published-android-market/\"\u003eA few years\nago\u003c/a\u003e\nI posted \u003ca href=\"http://bitbucket.org/synic/supacount\"\u003eSupaCount\u003c/a\u003e to the\nAndroid market. Shortly after that, I stopped posting updates for three\nyears.\u003c/p\u003e\n",
  "title": "Supa Dupa Count",
  "slug": "supa-dupa-count",
  "tags": [
    "Programming",
    "Android",
    "Scala"
  ],
  "isPublished": true
}
