{
  "publishedAt": "2012-07-18T19:17:02-07:00",
  "body": "\u003cp\u003eThis year, I went to the Lute Society of America Seminar at Case Western\nReserve University in Cleveland, Ohio. It was a lot of fun, and I'm going to\nshare some of my experience here.\u003c/p\u003e\n\u003cp\u003eGetting there with a lute was quite an adventure. Lutes are terribly delicate\ninstruments, even the larger ones weigh no more than a few pounds. Trusting the\nairline not to body slam a very expensive belonging like this pushes your\nlimits. While my lute made it unharmed, it's case is marred all over now.\u003c/p\u003e\n\u003cp\u003eIt was set up like a lot of the computer conferences that I've been to, UTOSC,\nBrainshare, etc, in that there are classes that you can choose to go through,\nyou're surrounded by a bunch of people with a common interest, there's plenty\nof nerds about and only a few women, and you get to meet people at the top of\nfood chain in the subject. The differences, though, were that at this\n\u0026quot;conference\u0026quot;, I really had no idea about most of what they were talking about,\nit was a week long, and there were amazing concerts every night.\u003c/p\u003e\n\u003cp\u003eEvery single day was exhausting. I would get up every morning at 6:30am (which\nis four hours earlier than I get up at home, due to the time change and general\nlaziness) in order to be ready for breakfast at 7. Classes would start at 9am,\ngo to 11:30, at which point you were on your own for lunch. Every other day\nthere was an afternoon concert at 1pm. Classes resumed at 2:15 and ended at\n5:30, dinner was served at 6pm, and then the night concert went from 7:30 to\n9:30. After that there was socializing and practicing until you went to bed,\nand then you'd do it all over again in the morning.\u003c/p\u003e\n\u003cp\u003eBecause I am new to the lute, and there weren't many beginner classes, I\nusually went to whatever master class was going on during a specific hour. In a\nmaster class, one or two people volunteer to play a piece for the lecturer (who\nis an expert on the instrument at hand), and then they receive instruction on\nhow they can do better. I found these classes to be very informative on\ntechnique, playing with feeling, etc. Also, it was very good just to see the\nmasters at work. Even the very best attendee's skills paled in comparison.\u003c/p\u003e\n\u003cp\u003eThe concerts were absolutely amazing. The audience, all being lute lovers\nthemselves, were entirely captivated... not a cough or sneeze could be heard.\nEvery single one I'd just sit there in awe with goosebumps up and down my arms.\u003c/p\u003e\n\u003cp\u003eOne thing I learned by meeting Paul O'dette, Robert Barto, Nigel North, Eduardo\nEguez, is that what I thought was the entire corpus of knowledge before I went,\nwas really just scratching the surface of what there is to know. Not only are\nthese people fantastic musicians, but they are all historians when it comes to\nearly music. They know which composer was where when he wrote what piece, and\nwhy. It was quite overwhelming at times, but always very interesting.\u003c/p\u003e\n\u003cdiv class=\"restored-from-archive\"\u003e\n  \u003ch3\u003eRestored from VimTips archive\u003c/h3\u003e\n  \u003cp\u003e\n  This article was restored from the VimTips archive. There's probably\n  missing images and broken links (and even some flash references), but it\n  was still important to me to bring them back.\n  \u003c/p\u003e\n\u003c/div\u003e",
  "summary": "\u003cp\u003eThis year, I went to the Lute Society of America Seminar at Case Western\nReserve University in Cleveland, Ohio. It was a lot of fun, and I'm going to\nshare some of my experience here.\u003c/p\u003e\n",
  "title": "Lute Society of America Seminar 2012",
  "slug": "lute-society-america-seminar-2012",
  "tags": [
    "Music"
  ],
  "isPublished": true,
  "openGraph": {
    "title": "Lute Society of America Seminar 2012",
    "type": "article"
  }
}