{
  "publishedAt": "2024-11-25T12:08:11-07:00",
  "extra": {
    "ogImage": "/static/img/screenshots/jbother.png"
  },
  "body": "\u003cp\u003eIn 2003, I released my very first opensource project,\n\u003ca href=\"https://github.com/synic/JBother\"\u003eJBother\u003c/a\u003e. A Jabber client, written in Java.\u003c/p\u003e\n\u003ca href=\"/static/img/screenshots/jbother.png\"\u003e\n  \u003cimg src=\"/static/img/screenshots/jbother.png\" alt=\"JBother screenshot\" width=\"400\" height=\"243\"/\u003e\n\u003c/a\u003e\n\u003cp\u003eIt was an awesome experience. I learned a lot of Java, Swing, and a lot about\nthe jabber protocol itself. \u003cem\u003eOther people\u003c/em\u003e wanted to use it, which felt pretty\ngood, I have to say.\u003c/p\u003e\n\u003cp\u003eI used it to talk to everyone. It supported a lot of advanced jabber features,\nlike groupchat and transport registration (which meant it supported AIM, MSN\nMessenger, etc). Eventually, several other programmers became interested and\nstarted contributing. UCLA started using it. It was \u003cem\u003esomewhat\u003c/em\u003e popular,\nas far as jabber clients go.\u003c/p\u003e\n\u003cp\u003eEventually, jabber seemed to go out of style, and Google Talk removed support\nfor it, making it a lot less useful for me. I continued to support it for a few\nmore years until all interest died off, and then I stopped working on it.\nEventually I just let the domain expire.\u003c/p\u003e\n\u003ch1 id=\"someone-else-has-taken-over\"\u003eSomeone Else Has Taken Over? \u003ca class=\"header-anchor\" href=\"#someone-else-has-taken-over\"\u003e  ¶\u003c/a\u003e\u003c/h1\u003e\n\u003ca href=\"https://jbother.org\"\u003e\n  \u003cimg src=\"/static/img/screenshots/jbothersite.png\" alt=\"Jbother\nsite screenshot, click to go to the new site\" /\u003e\n\u003c/a\u003e\n\u003cp\u003eThe other day I was looking for screenshots of it, and found that the main\nsite, \u003ca href=\"https://jbother.org\"\u003ehttps://jbother.org\u003c/a\u003e was back, and looked nearly identical to the site I\nhad abandoned. The whois info shows nameservers that I've never used before.\u003c/p\u003e\n\u003cp\u003eIt's serving up a single release, \u003ccode\u003eJBother-0.8.9.jar\u003c/code\u003e, the last\none I ever made. However, I have no idea if the jar file is the one I made, or\nsomething full of malware. I've downloaded the file and looked over the\narchive, but it's been so long I can't tell what was there originally or what\nmight be new. The oldest timestamp in the file is 2006, which is probably\nabout correct, but who knows if the timestamps are spoofed. If this person\nwanted to take over the project, why didn't they contact me?\u003c/p\u003e\n\u003cp\u003eI really have no way of verifying that it's really my release or something\nelse.\u003c/p\u003e\n\u003cp\u003ePretty strange!\u003c/p\u003e\n",
  "summary": "\u003cimg src=\"/static/img/screenshots/jbother.png\" alt=\"JBother screenshot\" width=\"400\" height=\"243\"/\u003e\n\u003cp\u003e15 years or so ago, I abandoned my first opensource project,\n\u003ca href=\"https://github.com/synic/JBother\"\u003eJBother\u003c/a\u003e and eventually let the domain\nexpire. However, someone, I have no idea who, has rehosted the site, with my\ndesign, etc, with very little modifications. Whoever did it has not contacted\nme at all.\u003c/p\u003e\n\u003cp\u003eWhat is going on here?\u003c/p\u003e\n",
  "title": "JBother brought back to life? Nefarious?",
  "slug": "jbother-brought-back-to-life",
  "tags": [
    "Random"
  ],
  "isPublished": true
}