{
  "publishedAt": "2026-02-12T12:17:06-07:00",
  "body": "\u003cp\u003eWhen I was making the current version of this blog, there was a lot of\ndiscussion on Twitter around improving load times and responsiveness on dynamic\nwebsites, complete with lots of demonstrations of instant load times even for\nthings that access the database, like searches. I decided to see what I could\npull off with this little site, served from a cheap VPS. I was able to get it\nto a perfect score on Lighthouse, and indeed, if you click around on the links\nor use the search box, you will see that things load pretty much instantly.\u003c/p\u003e\n\u003cimg src=\"/static/img/screenshots/lighthouseresults.webp\" alt=\"Lighthouse Results\" width=\"600\" height=\"193\" /\u003e\n\u003ch2 id=\"how\"\u003eHow \u003ca class=\"header-anchor\" href=\"#how\"\u003e  ¶\u003c/a\u003e\u003c/h2\u003e\n\u003cp\u003eI used a few different technologies and ideas:\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003e\n\u003cp\u003eGo backend. As of today, the entire site is served from a single statically\ncompiled binary that is only 7MB. Even the assets (images, CSS, JavaScript,\narticles) are embedded directly in the binary.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eThe articles themselves are pre-rendered in the build process, embedded\ndirectly in the compiled binary, and are all loaded into memory during boot,\nwhere they stay.\u003c/p\u003e\n\u003cp\u003eThere is no database access for individual articles or searching, everything\nis accessed directly from memory. I did some tests to make sure this was going\nto be reasonable, even with a ton of articles, and I found that I could\nprobably write a couple articles a week for the rest of my life without causing\nany real problems. The storage adapter can be change to use a database if it\never becomes absolutely necessary, and then I can just cache frequently accessed\narticles.\u003c/p\u003e\n\u003cp\u003eAt some point I will add a comment system, and while those\n\u003cem\u003ewill\u003c/em\u003e be in a database, they will only be loaded on demand when the viewer\nclicks on the \u0026quot;View Comments\u0026quot; button.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eWhen you are navigating around the site, I used HTMX to only change the\nparts of the page that are different; the header, general layout, and\nfooter do not change.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ol\u003e\n",
  "summary": "\u003cp\u003eWhen I was making the current version of this blog, there was a lot of\ndiscussion on Twitter around improving load times and responsiveness on dynamic\nwebsites, complete with lots of demonstrations of instant load times even for\nthings that access the database, like searches. I decided to see what I could\npull off with this little site, served from a cheap VPS. I was able to get it\nto a perfect score on Lighthouse, and indeed, if you click around on the links\nor use the search box, you will see that things load pretty much instantly.\u003c/p\u003e\n\u003cimg src=\"/static/img/screenshots/lighthouseresults.webp\" alt=\"Lighthouse Results\" width=\"600\" height=\"193\" /\u003e",
  "title": "How I made this blog fast",
  "slug": "how-i-made-this-blog-super-fast",
  "tags": [
    "Programming",
    "Go"
  ],
  "isPublished": true,
  "openGraph": {
    "title": "How I made this blog fast",
    "type": "article"
  }
}