{
  "published_at": "2009-12-02T16:41:51-07:00",
  "body": "\u003c!-- :metadata:\n\ntitle: Switching from the iPhone to the Droid\ntags: Gadgets\npublished: 2009-12-02T16:41:51-0700\nsummary:\n\nI bought myself the first generation iPhone about 8 days after it came out, and\nhave followed the upgrade path (getting the 3G and 3Gs as soon as they were\navailable) clear up until about a week and a half ago, when I jumped ship from\nAT\u0026T.  I love the iPhone.  Sure, there are some things that bother me about it,\nbut it really was good to me.  Especially now, that a lot of the features I was\nmissing in a phone were suddenly there (copy \u0026 paste, MMS, etc).\n\n--\u003e\n\u003cp\u003eI bought myself the first generation iPhone about 8 days after it came out,\nand have followed the upgrade path (getting the 3G and 3Gs as soon as they were\navailable) clear up until about a week and a half ago, when I jumped ship from\nAT\u0026T.  I love the iPhone.  Sure, there are some things that bother me about it,\nbut it really was good to me.  Especially now, that a lot of the features I was\nmissing in a phone were suddenly there (copy \u0026 paste, MMS, etc).  \u003c/p\u003e\n\u003cp\u003eEverything was great until I moved from SLC to Seattle, where my data plan\ntook a horrible turn for the worst.  Even with full bars, I could rarely access\nwebpages, post to twitter, read my headlines on facebook, or send an email.\nAT\u0026T was less than helpful, asking me to \"restore\" my iPhone to factory\nsettings, which didn't do much for me at all. Living in Utah, where AT\u0026T is\ngrand, I really didn't ever get the reports I read about their service being\npoor (\u003ca\nhref='http://www.techflash.com/seattle/2009/04/iPhone_3G_network_problems_in_Seattle_44079232.html'\u003ehere's\nan example\u003c/a\u003e).  Now I do.\u003c/p\u003e\n\u003cp\u003eI flew back to Utah about a week before Thanksgiving to spend the holiday\nwith my family.  Whoop, suddenly my data service works again!  A couple of my\nfriends had picked up a Motorola Droid (and thus, Verizon) recently, one of\nthem even coming from an iPhone.  Both of them said they liked it.  One of them\n(the one that switched from an iPhone) was actually in Seattle that week for\nthe MLS cup, and said the Verizon coverage in the city was great.  So, I jumped\non the bandwagon, and purchased a Droid.\u003c/p\u003e\n\u003cp\u003eBeing an iPhone/AT\u0026T user for 3 1/2 years jumping to the Droid/Verizon has\nbeen a little rough for me.  Now, while I realize that a week and a half is a\npretty short time to develop a great opinion of the Droid, I'm pretty sure I've\ngot a fairly good grasp of it.  Here are the pros and the cons for a user\nswitching from the iPhone to a Droid - I'm listing the cons first since I'm\nsure those will be the ones people will want to look at first if they are\nconsidering the change:\u003c/p\u003e\n\u003ch2\u003eCons\u003c/h2\u003e\n\u003col\u003e\n  \u003cli\u003eVerizon's Visual voicemail app pales in comparison to the one provided by\n  Apple/AT\u0026T.  Here's why:\n    \u003cul\u003e\n    \u003cli\u003eConstant notifications that a connection could not be made to the\n    visual voicemail service.  I get one each time I boot up the phone - I\n    assume this is because the background service of the app starts before the\n    network connection is made.  I also get them randomly througought the this\n    day.\u003c/li\u003e\n\u003cli\u003eThe service costs $2.99\u003c/li\u003e\n    \u003cli\u003eYou cannot listen to or delete Visual Voicemail messages while\n    connected to a Wireless network.  If you try to do so, the application will\n    completely shut down your wireless connection, and it won't bring it back\n    up automatically when you're done.  \u003c/li\u003e\n    \u003cli\u003eThe app itself looks like it was made in 1999.  The\n    buttons/widgets/gradients are low resolution and generally look like crap.\n    Take a look at the screenshots below and you'll see what I mean.\u003c/li\u003e\n    \u003c/ul\u003e\n\u003cp\u003e\n(Click on an image to view the full size).\n    \u003c/p\u003e\n    \u003cp style='width: 100%; padding-bottom: 10px'\u003e\n\u003ccenter\u003e\n\u003ca href='/media/images/visualvoicemail.png'\u003e\u003cimg\nborder='0' src='/media/images/visualvoicemail.png'\nwidth='200'\u003e\u003c/a\u003e\n\u003ca href='/media/images/visualvoicemailwarning.png'\u003e\u003cimg\nborder='0' src='/media/images/visualvoicemailwarning.png'\nwidth='200'\u003e\u003c/a\u003e\u003c/center\u003e\n    \u003c/p\u003e\n\u003cdiv style='height: 20px'\u003e\u0026nbsp;\u003c/div\u003e\n\u003cpre\u003e\u003ccode\u003e\u0026lt;/li\u0026gt;\n\u003c/code\u003e\u003c/pre\u003e\n\u003cli\u003eThe Android API itself seems to have a lot less in the way of user\ninterface design standards and stock icons.  There's not really a common theme\nbetween different apps on the phone, let alone in the apps on available in the\nAndroid Market.  The SMS has nice clean dark theme, while the Camera app\nappears as though it was designed to look like it was made out of brushed\ngranite.  A lot of the apps on the market have buttons with weird fonts, weird\ncolors, and weird layout positioning.  Everything on the iPhone is pretty\nseemless, and in most cases, has a unified design that's familiar when\nswitching from application to application.\u003c/i\u003e\n\u003cli\u003eGames.  There are probably 10 games in the Android Market that are worth\npurchasing.  No \"Worms\", no \"Doom Ressurection\", no \"Super Monkey Ball\".  I\nthink you get the point.  Sure, there weren't many great games for the iPhone\nwhen the app store and SDK first arrived, but the simple fact is, Android\ndoesn't have them \u003ci\u003enow\u003c/i\u003e.\u003c/li\u003e\n\u003cli\u003eYou cannot surf the web and be on a phone call at the same time. \u003c/li\u003e\n\u003cli\u003eI don't know if it's Verizon's network, or the Droid itself, but SMS\nmessages have a hard limit of 160 characters.  I know that this is the SMS\nstandard, but somehow the iPhone gets around it.  Whether it pieces multiple\nSMSes together when recieving, or it splits long ones into multiple packets\nwhen delivering, it doesn't really matter.  With the iPhone, you really don't\nneed to worry about the length of your SMS.  \u003cbr /\u003e\u003cbr /\u003e\n\u003cp\u003eComposing an SMS longer than 160 characters on the Droid and sending it to a\ncontact on another network will result in the message being truncated to 160\ncharacters.  There is no automatic splitting, the contact simply will not\nrecieve the entire message.\n\u003cbr /\u003e\u003cbr /\u003e\nThere's an SMS replacement app on the Android Market that'll automatically\nsplit any SMS that's longer than 160 characters, but while using it, the alerts\nI get from our Nagios server via Verizon's email to SMS gateway are still\ntruncated at 160 characters, making the messages fairly useless to me.  The app\nis also terribly ugly, suffering from UI weirdness like I described in number\n2.\u003c/li\u003e\u003c/p\u003e\n\u003cli\u003eNo pinch to zoom in the built in browser.  I have seen it on the Eris, and\nit even works in a 3rd party browser called \"Dolphin\", so it's not the hardware\nthat's causing this limitation, but the functionality definitely is not present\nin the Droid's default browser.\u003c/li\u003e\n\u003cli\u003eThe Micro SD card system.  You cannot store apps on the included 16GB SD\ncard.  You can only store them in the 256MB built in storage.  Possibly because\nof security reasons?  I don't know.  Apps can \u003ci\u003eaccess\u003c/i\u003e data on the SD\ncard, which probably makes all of this a moot point.  All of the gigantic apps\nI used on the iPhone consumed their space using data that could probably be\ndownloaded to the SD card after the app is installed and launched for the first\ntime.  For instance, Doom Ressurection (50mb or so if I remember correctly),\nand the TomTom app (1.7GB).\u003c/li\u003e\n\u003c/ol\u003e\n\u003ch2\u003ePros\u003c/h2\u003e\n\u003col\u003e\n\u003cli\u003eThe obvious.  Verizon's data network actually works where I live.\u003c/li\u003e\n\u003cli\u003eMultitasking.  I love how Android does this.  I love that you can keep\napplications open, and switch around between them at will.  Sure, the iPhone's\nhardware supports this, and some of Apple's apps even make use of it, but this\nstuff has been purposely left out of the public SDK.  The only way around it is\nto Jailbreak.\n\u003cbr /\u003e\u003cbr /\u003e\nWith Android, it's more than just having multiple applications running at the\nsame time.  The SDK also allows you to create services that run in the\nbackground.  Services that can use Android's cool notification system to alert\nyou of things, which brings us to:\u003c/li\u003e\n\u003cli\u003eThe notification system.  Google has created a way for applications to\nalert you in a non-obtrusive and super useful way.  The statusbar at the top of\nthe screen can display little icons and little blurbs of text when something of\ninterest happens.  A simple swipe of the finger and you can see a list of\nrecent notifications; tap on one and you can switch to the application that\ncause the notification.  The iPhone has nothing like this.  It has \"badges\" and\nalert windows (which are most definitely NOT non-obtrusive). \u003c/li\u003e\n\u003cli\u003eThe keyboards.  Both of them.  I like the physical keyboard because, well,\nit's a physical keyboard.  Yes, the keys are a bit cramped, but I did get used\nto it eventually.  The software keyboard is somewhat better than the one on the\niPhone.  It does everything that the iPhone's does, but the autocorrection is a\nLOT better, simply because it provides you a list of words to choose from, and\nallows you to click on the one you like the most instead of always just picking\none for you (though it'll do that too if you opt not to pick one).\u003c/li\u003e\n\u003cli\u003eThe Android Market (app store) policies.  There basically are none.  I've\ndone a touch of iPhone development, and I can tell you that Apple will most\nlikely NOT approve an app if it doesn't somehow help their bottom line.  If\nyou're trying to sell a service with your app, direct business to your website,\netc, then good luck.  If you're trying to duplicate functionality that's\nalready present on the iPhone, even if you think you can do it better, good\nluck with that too.  \u003c/li\u003e\n\u003cli\u003eMore on the SDK:  Android allows you to replace system components.  Don't\nlike the built in software keyboard?  You can replace it with one from the App\nstore.  You can route phonecalls through the Google Voice App.  You can replace\nthe SMS app entirely with a new one.  You can replace the Home screen with a\nnew one.  You can cause an app to start when another one starts: for instance,\nthe Last.FM app will start and scrobble your music automatically when you open\nAndroid's music player.\n\u003cbr /\u003e\u003cbr /\u003e\nAlso, you don't need to buy a Mac to write Android applications.  You can write\nthem completely for free using the operating system of your choice.  \u003c/li\u003e\n\u003cli\u003eYou can download applications from random websites, bypassing the Android\nmarket all together.  Find a link to a sweet app?  Just click from the Android\nBrowser and it'll download and install for you.  No way in hell Apple would let\nthis type of thing happen.  How would they get any money this way?\u003c/li\u003e\n\u003cli\u003eMass storage capability for the SD card.  You can simply mount the SD card\non your computer (running any OS that supports Mass Storage) and copy your\nmusic/videos over.  You aren't stuck using iTunes to get music on the phone.\n\u003c/li\u003e\n\u003c/ol\u003e\n\u003ch2\u003eSome other notes:  \u003c/h2\u003e\n\u003col\u003e\n\u003cli\u003eConnectBot, the SSH client on the Android platform, is quite a bit better\nthan the options on the iphone.  It supports your screen+irssi+nicklist.pl\nsession quite nicely.  It's fast.  It resizes the terminal contents corretly.\nWith the physical keyboard, your input method isn't getting in the way.\u003c/li\u003e\n\u003cli\u003eAndroid lacks the super sweet TomTom app that the iPhone app store has,\nthough it does include Google Navigation.  Google navigation is fine, however,\nyou cannot use it in areas where there is low or no signal because it transfers\nmap data over the air as you drive.  The TomTom app on the iPhone takes up\nabout 1.7GB of your precious music space, so there's a downside to that as\nwell.\n\u003cbr /\u003e\u003cbr /\u003e\nAnother thing about Google Navigation is that it doesn't automatically shut\ndown when you get a phone call.  I found this out the hard way, answering a\nphone call, only to have the other person get talked over by the\ncomputerized voice trying to give me driving directions.\u003c/li\u003e\n\u003c/ol\u003e\n\u003ch2\u003eConclusion\u003c/h2\u003e\n\u003cp\u003eSwitching from iPhone OS to Android reminds me a whole lot of when I switched\nfrom Windows to Linux years ago.  I feel like I've switched to the better\nplatform that isn't quite ready yet.  A lot of the apps feel like they were\nwritten by programmers who have never heard of the word \u0026quot;aesthetic\u0026quot;.  Android\nisn't quite as pretty as the iPhone OS.  It doesn't have core animation.  It\ncertainly doesn't have the great team of graphic designers that Apple has.  It\nis open, though, less restrictive, and it shows.  To me, that openness is more\nimportant than the pretty looks, so even if AT\u0026amp;T \u003ci\u003edid\u003c/i\u003e work well where I\nlive, knowing what I know now, I'd probably still consider switching.  I hate\nthe feeling I get from Apple's greedy SDK rules and restrictions.\u003c/p\u003e\n\u003cdiv class=\"restored-from-archive\"\u003e\n  \u003ch3\u003eRestored from VimTips archive\u003c/h3\u003e\n  \u003cp\u003e\n  This article was restored from the VimTips archive. There's probably\n  missing images and broken links (and even some flash references), but it\n  was still important to me to bring them back.\n  \u003c/p\u003e\n\u003c/div\u003e\n",
  "summary": "\u003cp\u003eI bought myself the first generation iPhone about 8 days after it came out, and\nhave followed the upgrade path (getting the 3G and 3Gs as soon as they were\navailable) clear up until about a week and a half ago, when I jumped ship from\nAT\u0026amp;T.  I love the iPhone.  Sure, there are some things that bother me about it,\nbut it really was good to me.  Especially now, that a lot of the features I was\nmissing in a phone were suddenly there (copy \u0026amp; paste, MMS, etc).\u003c/p\u003e\n",
  "title": "Switching from the iPhone to the Droid",
  "slug": "switching-apple-iphone-motorola-droid",
  "tags": [
    "Gadgets"
  ],
  "is_published": true
}