{
  "published_at": "2008-10-22T22:59:36-07:00",
  "body": "\u003c!-- :metadata:\n\ntitle: Exaile 0.3 Roundup for October 22, 2008\ntags: Exaile\npublished: 2008-10-22T22:59:36-0700\nsummary:\n\nOk, so I posted the weekly tarball a little early, because it's got lots of\ncool new stuff.  Here are the things that have been completed since the last\nroundup:\n\n--\u003e\n\u003cp\u003eOk, so I posted the weekly tarball a little early, because it's got lots of\ncool new stuff.  Here are the things that have been completed since the last\nroundup:\u003c/p\u003e\n\u003cp\u003e\n\u003cul\u003e\n\u003cli\u003ePreferences dialog and all the preferences in it now actually work.  There\naren't many preferences to choose from yet, however, it'll be super easy to add\nnew ones.\u003c/li\u003e\n \u003cli\u003ePlugin manager.  You can now enable and disable the\nplugins that are currently bundled with Exaile 0.3, which include Amazon Album\nArt, LastFM Album Art, AudioScrobbler, CD Playback, PythonConsole, Gnome\nMultimedia Keys, LastFM Dynamic Search, Lyrics Fly, Lyrics Wiki (the lyrics\nengine isn't quite ready, so for the regular user, these plugins are probably\nuseless), Notify, Shoutcast Radio, and Streamripper.  There is not yet a way to\ninstall or see new/available plugins from this plugin manager yet.\u003c/li\u003e\n\u003cli\u003eGotta mention Streamripper again, because up until last night Exaile 0.3\ndidn't yet have the Streamripper plugin\u003c/li\u003e\n \u003cli\u003eNew groovy method for\nsetting plugin preferences.  Instead of having a popup dialog for each plugin\nwhen you click \"Configure\", there is a \"Plugins\" category in the main\npreferences dialog where you can set preferences for plugins that have a\npreferences pane defined (currently only streamripper and audioscrobbler have\none).\u003c/li\u003e\n \u003cli\u003eLastFM Dynamic mode works if you check the dynamic playlist\noption\u003c/li\u003e\n \u003cli\u003eMore bug fixes\u003c/li\u003e\n \u003c/ul\u003e\u003c/p\u003e\n \u003cp\u003eThe new weekly tarball\nwith all of this stuff can be found \u003ca\nhref='http://exaile.org/files/weekly/exaile_0.3.0_20081022.tar.gz'\u003ehere\u003c/a\u003e.\u003c/p\u003e\n\u003cdiv class=\"restored-from-archive\"\u003e\n  \u003ch3\u003eRestored from VimTips archive\u003c/h3\u003e\n  \u003cp\u003e\n  This article was restored from the VimTips archive. There's probably\n  missing images and broken links (and even some flash references), but it\n  was still important to me to bring them back.\n  \u003c/p\u003e\n\u003c/div\u003e\n",
  "summary": "\u003cp\u003eOk, so I posted the weekly tarball a little early, because it's got lots of\ncool new stuff.  Here are the things that have been completed since the last\nroundup:\u003c/p\u003e\n",
  "title": "Exaile 0.3 Roundup for October 22, 2008",
  "slug": "exaile-03-roundup-october-22-2008",
  "tags": [
    "Exaile"
  ],
  "is_published": true
}