{
  "published_at": "2009-07-09T16:51:34-07:00",
  "body": "\u003c!-- :metadata:\n\ntitle: Exaile 0.3 Update for July 9, 2009\ntags: Exaile, Programming, Linux\npublished: 2009-07-09T16:51:34-0700\nsummary:\n\nDon't worry, we're still here, and still hard at work.  I thought I would give\nan update since it's been quite a while since the last one.\n\n--\u003e\n\u003cp\u003eDon't worry, we're still here, and still hard at work.  I thought I would give\nan update since it's been quite a while since the last one.\u003c/p\u003e\n\u003cp\u003eWe've decided that we're going to shoot hard to get a 0.3 release ready for the\nAugust Ubuntu feature freeze.  This may mean that 0.3 doesn't have \u003cem\u003eall\u003c/em\u003e the\nfeatures that 0.2.14 had, but I feel that it's got enough.  However, as a trade\noff, 0.3 will have a \u003cem\u003elot\u003c/em\u003e of other features that 0.2.14 never had.\u003c/p\u003e\n\u003cp\u003eCurrently, there appear to be a lot of people already using 0.3.  User\ncontributions to Exaile itself are higher right now than they've ever been.\nThere are currently 27 user contributed or developer written plugins in the\nrepository.\u003c/p\u003e\n\u003cp\u003eOne of our awesome users contributed a patch that enabled rating tracks by just\nclicking on the appropriate star in the playlist, much like Rhythmbox does.\nI've tried to do this myself a few times and have never had much success.\nGone, now, is the old rating dropdown, which leaves us with a lot of free space\nin the upper right of the UI.  We haven't even discussed what might go there,\nbut perhaps an equalizer interface would be useful (please please please don't\ntake this as law, we really haven't said so much as two words about this).\u003c/p\u003e\n\u003cp\u003eMathias Brodala has been a friend of the project.  Initially, he did German\ntranslations, and then he was given the job of being the translation manager.\nRecently, he's been learning Python and contributing with code.  Mathias, I\ndidn't even know you knew how to program.  What a pleasant surprise :)\u003c/p\u003e\n\u003cp\u003eAnyway, that's it for today.  Things are moving along quite nicely.  Hopefully\nwe can make our August goal.\u003c/p\u003e\n\u003cdiv class=\"restored-from-archive\"\u003e\n  \u003ch3\u003eRestored from VimTips archive\u003c/h3\u003e\n  \u003cp\u003e\n  This article was restored from the VimTips archive. There's probably\n  missing images and broken links (and even some flash references), but it\n  was still important to me to bring them back.\n  \u003c/p\u003e\n\u003c/div\u003e\n",
  "summary": "\u003cp\u003eDon't worry, we're still here, and still hard at work.  I thought I would give\nan update since it's been quite a while since the last one.\u003c/p\u003e\n",
  "title": "Exaile 0.3 Update for July 9, 2009",
  "slug": "exaile-03-update-july-9-2009",
  "tags": [
    "Exaile",
    "Programming",
    "Linux"
  ],
  "is_published": true
}