{
  "published_at": "2009-10-09T14:39:46-07:00",
  "body": "\u003c!-- :metadata:\n\ntitle: Utah OpenSource Conference 2009\ntags: Linux\npublished: 2009-10-09T14:39:46-0700\nsummary:\n\nThe \u003ca href='http://2009.utos.org'\u003eUtah OpenSource Conference\u003c/a\u003e went underway\nyesterday.  I thought I'd share my experiences and thoughts here as the con\nprogresses.\n\n--\u003e\n\u003cp\u003eThe \u003ca href='http://2009.utos.org'\u003eUtah OpenSource Conference\u003c/a\u003e went\nunderway yesterday.  I thought I'd share my experiences and thoughts here as\nthe con progresses.\u003c/p\u003e\n\u003ch3\u003eDay 1\u003c/h3\u003e\n\u003cp\u003eToday I registered, and manned the \u003ca\nhref='http://www.ubuntu.com'\u003eUbuntu\u003c/a\u003e booth with Mike Basinger, Bryan Petty,\nMatthew Washburn, and James VanTassel for the entirety of the day.  All the\nlaptops demonstrating Ubuntu at the booth were mine, so I wasn't very\ncomfortable leaving for a presentation.  Tomorrow I'll just bring my desktop,\nit'll be a lot harder for someone to walk off with and I'll be able to see some\nof the ones I want to see.\u003c/p\u003e\n\u003cp\u003eThe Ubuntu booth got some pretty good participation, lots of people stopped\nand either asked for more information about Ubuntu, or just to tell us what\nthey already knew and liked.  Lots of questions about 9.10 coming out on the\n29th.  During most of the day there were about 4-5 people gathered around\ntalking.\u003c/p\u003e\n\u003ch3\u003eDay 2\u003c/h3\u003e\n\u003cp\u003eManned the Ubuntu booth again.  Today I got to see the keynote by Stormy\nPeters, which brought up some interesting aspects and some of the downsides of\nbeing paid for work on opensource projects.  \u003c/p\u003e\n\u003cp\u003eI also went to Mac Newbold's presentation entitled \"Why FreeBSD is the Best\nLinux Distro*\", which inspired me to, yet again, try to install FreeBSD as my\nmain operating system on my home desktop machine.  I am compiling the\nx11/gnome2 port as I am typing this article.  He spent most of the time\npresenting about how Linux is different from FreeBSD, rather than aspects of\nwhy he thinks FreeBSD is actually better than Linux.  Currently, I believe that\nunless you're hell bent on believing that installing packages from source is\nthe best way, the only compelling reason for me is the license.  I happen to\nlike the FreeBSD license more than the GPL.  More than that, I find FreeBSD to\nbe a fun challenge, much like Linux was when I first started using it.  I'll\nhave to see how it goes once I'm done getting everything installed - I'm pretty\ndetermined this time to figure out all there is to figure out about using\nFreeBSD as a desktop operating system.\u003c/p\u003e\n\u003ch3\u003eDay 3\u003c/h3\u003e\n\u003cp\u003eWasn't feeling well this day, so I didn't end up going.  Yes, I realize that\nmakes the conclusion of the article a little anti-climactic.  However, I did\nend up getting Gnome in FreeBSD working well, and I'll write up what I needed\nto do, how long it took, etc, in another blog entry.\u003c/p\u003e\n\u003cdiv class=\"restored-from-archive\"\u003e\n  \u003ch3\u003eRestored from VimTips archive\u003c/h3\u003e\n  \u003cp\u003e\n  This article was restored from the VimTips archive. There's probably\n  missing images and broken links (and even some flash references), but it\n  was still important to me to bring them back.\n  \u003c/p\u003e\n\u003c/div\u003e\n",
  "summary": "\u003cp\u003eThe \u003ca href='http://2009.utos.org'\u003eUtah OpenSource Conference\u003c/a\u003e went underway\nyesterday.  I thought I'd share my experiences and thoughts here as the con\nprogresses.\u003c/p\u003e\n",
  "title": "Utah OpenSource Conference 2009",
  "slug": "utah-opensource-conference-2009",
  "tags": [
    "Linux"
  ],
  "is_published": true
}