{
  "published_at": "2012-02-13T18:29:30-07:00",
  "body": "\u003c!-- :metadata:\n\ntitle: Things you should know before posting your comment on the Android market\ntags: Android\npublished: 2012-02-13T18:29:30-0700\nsummary:\n\nYeah, ok, this post is more of a rant that anything.   I realize that people\nactually reading this article probably aren't the ones that post my most\nunfavorite comments on the market, but I don't care.  I'm posting it anyway.\n\n--\u003e\n\u003cp\u003eYeah, ok, this post is more of a rant that anything.   I realize that people\nactually reading this article probably aren't the ones that post my most\nunfavorite comments on the market, but I don't care.  I'm posting it anyway.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eFirst and foremost:\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eThe android market comments section is \u003cem\u003enot\u003c/em\u003e a good place to post bug reports.\nThere is no way for the author of the app to get in touch with you if they need\nmore information about the bug, and no real reliable way for them to even\nrespond to your post.  Please please PLEASE try and find their bug tracker, if\nthere is one.\u003c/p\u003e\n\u003cp\u003eWith that in mind, it's probably a better idea to use that same bug tracker to\nfile feature requests.  Especially if they are complicated.  Sure, it's fine\nfor something short and obvious, like \u0026quot;I wish you could change the font size\u0026quot;,\netc (though I'd prefer that no one ever use the market for any feature\nrequests).\u003c/p\u003e\n\u003cp\u003eDo your research.  I often see comments like the following:\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e\u003cem\u003e\u0026quot;The latest update of this app starts up upon booting your phone,\nuninstalling\u0026quot;\u003c/em\u003e\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eDoes this mean you just noticed that it requested boot permissions while\ninstalling it?  Or you actually noticed it was running immediately after boot?\nThe world will never know, because, as stated above, the developer cannot\ncontact you based on your comment.  Regardless, noticing that the app requires\nboot permissions or is running immediately after startup probably doesn't mean\nwhat you think it means.\u003c/p\u003e\n\u003cp\u003eIn the case of SupaCount, it starts on boot to reset the alarms that were wiped\nout during the reboot.  This means it starts up, registers any alarms with the\nAndroid Alarm Manager, and then quits.  However, because of the way Android\nmemory management works, it'll probably still show up in your Task Manager app\n(more on these evil things later), because the OS keeps it around for a while,\njust in case it's needed again.  If the OS needs this memory for something else\nbefore that happens, it'll discard it, and that's when it will stop showing up\nin your running tasks.\u003c/p\u003e\n\u003cp\u003eI imagine \u003cem\u003emost\u003c/em\u003e apps are doing something similar to this.  A lot of apps use\nthe AlarmManager to wake the app up periodically so that it can perform some\nbackground task.  For instance, the OkCupid app used to wake up every 15\nminutes or so to check to see if you had any new messages.  In order for the\napp to schedule these events with the AlarmManager, it needs to be started at\nboot, otherwise, those events will never get registered.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e\u003cem\u003e\u0026quot;One star.  App is constantly running in the background hogging all my\nmemory\u0026quot;\u003c/em\u003e\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eLikely the app is just waking up to check something periodically, like I\nmentioned above.  Even if it is actually running in the background all the\ntime, your memory is not what you need to be worried about.  If the OS needs\nthe memory and a certain app is hogging too much, that app will be killed.  No\nexceptions.  Giving an app a bad rating or uninstalling it all together just\nbecause you noticed it in your task manager is dumb.\u003c/p\u003e\n\u003cp\u003eWhat you should be worried about is your battery.  If an app is doing something\nconstantly in the background, it WILL eat away at your battery.  You can find\nout what apps eat up the most battery by going to Settings-\u0026gt;About\nPhone-\u0026gt;Battery Usage.\u003c/p\u003e\n\u003cp\u003eFor the reasons I just listed above, you should uninstall your task manager.\nThere are countless articles out there about why they are bad (do a search if\nyou don't believe me), and the Android developers have stated themselves that\nthey aren't needed.  Android memory management works differently than it does\non your computer.  An app in the foreground has priority over any app in the\nbackground.  If the OS needs memory for the app in the foreground, it will kill\napps in the background to get it.  In order to improve response times, android\nmay keep an app around in memory, even after you think you've exited, just in\ncase you need to open it again.  Like I said, though, if the OS needs that\nmemory, the app will be removed.\u003c/p\u003e\n\u003cp\u003eSo, if you see an app running in the task manager, it really has no meaning to\nyou.  There are several reasons it could be there, and you killing it is more\nlikely to cause problems than anything else.  If you're worried about your\nbattery, check your battery usage section, and if there's an app behaving\nbadly, uninstall it.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e\u003cem\u003e\u0026quot;I will give this app 5 stars if you enable installing to the SD card\u0026quot;\u003c/em\u003e\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eUhg.  It's not as easy as that.  There is a very specific set of criteria that\ndetermine if an app is installable to the SD card.  You can see that list here:\nhttp://developer.android.com/guide/appendix/install-location.html#ShouldNot\u003c/p\u003e\n\u003cp\u003eA lot of it has to do with what happens when your SD card is unmounted (which\nhappens when you attach your phone to your computer).\u003c/p\u003e\n\u003cp\u003eIn the case of SupaCount, it can't be installed to the SD card because the\nstartup apps are run before the SD card is attached, so any apps that need to\nbe run at startup cannot be installed on the SD card.\u003c/p\u003e\n\u003cp\u003eDon't be an asshole.  Especially if the app is free.  The author does not owe\nyou anything, and you freaking out the in comments is just going to get you\nignored.\u003c/p\u003e\n\u003cp\u003eA lot of this stuff probably applies to the iPhone App Store as well.  Just\nhave some common sense.  The rating and comment system is there simply so you\ncan state what you thought of the app, and so that other people can tell if the\napp is worth installing.  It's not a place to report bugs or ask for features.\u003c/p\u003e\n\u003cdiv class=\"restored-from-archive\"\u003e\n  \u003ch3\u003eRestored from VimTips archive\u003c/h3\u003e\n  \u003cp\u003e\n  This article was restored from the VimTips archive. There's probably\n  missing images and broken links (and even some flash references), but it\n  was still important to me to bring them back.\n  \u003c/p\u003e\n\u003c/div\u003e\n",
  "summary": "\u003cp\u003eYeah, ok, this post is more of a rant that anything.   I realize that people\nactually reading this article probably aren't the ones that post my most\nunfavorite comments on the market, but I don't care.  I'm posting it anyway.\u003c/p\u003e\n",
  "title": "Things you should know before posting your comment on the Android market",
  "slug": "things-you-should-know-posting-your-comment-androi",
  "tags": [
    "Android"
  ],
  "is_published": true
}